[
    {
        "text title": "Heart Disease",
        "coherence": "Fully Coherent",
        "texts": "The heart is the hardest working organ in the body. We rely on it to supply blood regularly to the body every moment of every day. Any disorder that stops the heart from supplying blood to the body is a threat to life. Heart disease is such a disorder. It is very common. More people are killed every year in the U.S. by heart disease than by any other disease. There are many kinds of heart disease, some of which are present at birth and some of which are acquired later. 1. Congenital Heart Disease A congenital heart disease is a defect that a baby is born with. Most babies are born with perfect hearts. But one in every 200 babies is born with a bad heart. For example, hearts have flaps, called valves, that control the blood flow between its chambers. Sometimes a valve develops the wrong shape. It may be too tight, or fail to close properly, resulting in congenital heart disease. Sometimes a gap is left in the wall, or septum, between the two sides of the heart. This congenital heart disease is often called a 'septal defect.' When a baby's heart is badly shaped, it cannot work efficiently. It cannot pump enough blood through the lungs so that it receives enough oxygen. As a result, the baby becomes breathless. The blood also cannot get rid of carbon dioxide through the lungs. Therefore, the blood becomes purplish, which causes the baby's skin to look blue. Fortunately, it is now possible to save the lives of many 'blue babies.' 2. Acquired Heart Disease Some heart diseases are acquired after the baby is born. Rheumatic fever is an example of an acquired disease that may cause damage to the heart. This disease usually follows a sore throat caused by bacteria known as streptococci. This is often called 'strep throat.' When strep throat causes rheumatic fever, the tissues of the heart become inflamed. If the heart is badly affected, it fails very soon. Usually, however, it recovers, and the results of the damage are seen only years later. This is because the rheumatic fever leaves scars in the valves of the heart. Therefore, they cannot work properly. This puts a strain on the heart so that eventually it may fail. The effects of the rheumatic fever may take up to twenty or thirty years to appear. Coronary disease is another example of an acquired heart disease. This disease affects the coronary arteries. These are the blood vessels that extend across the heart and supply it with blood from the lungs. They are very important because they give the heart muscle the oxygen it needs to carry on working. In coronary disease the coronary arteries become blocked, causing parts of the heart muscle to die because of the lack of oxygen. When this happens, the patient has a heart attack, which can be fatal. The blockage of a coronary artery is usually caused by a clot of blood, called a 'thrombus.' When a clot forms in a coronary artery, this is called 'coronary thrombosis.' That is the correct name for a heart attack. In normal arteries, blood does not form clots. But in coronary disease, the walls of the arteries are not normal. They become lumpy, rough, and narrow. The lumps break off and form clots that stop the flow of blood to the heart. Other examples of acquired heart disease are arrhythmia, angina, and high blood pressure. Arrhythmia, which means 'lack of rhythm,' is an interruption of the heart's normal beat. Angina is a sharp pain in the chest which is very similar to that caused by a heart attack, or thrombosis. High blood pressure is one of the most common heart diseases. It places a heavy strain on the heart and other organs. Therefore, if it is not treated, high blood pressure may lead to heart attacks, kidney failure, or other serious problems. High blood pressure is a disease which has no symptoms. Thus, a person may not be aware of having it unless the blood pressure is measured. 3. Treatment and Prevention of Heart Disease Since the mid-1960's, medical science has made tremendous progress in the treatment and prevention of heart disease. Both new drugs and new surgical methods have been developed. Among the new drugs for treating heart disease are chemicals called 'beta blockers.' The beta-blockers lessen the after-effects of heart attacks; they can prevent second attacks; and they can lower the blood pressure of people who have high blood pressure. Other drugs dissolve the lumps which break off the walls of arteries so that they do not stop the flow of blood to the heart. Surgical techniques for treating heart disease range from repairing or replacing damaged parts, such as valves or arteries, to replacement of the entire heart. If a heart has been so damaged that it can no longer function, it can be replaced by a mechanical heart, or, more often, by a heart transplant. In transplant surgery, the healthy heart of someone who has died replaces the diseased heart of the patient. Mechanical devices can be implanted in people's bodies to keep their hearts functioning. The pacemaker is the most common of these devices. It does not heal the diseased heart, but it relieves the symptoms of an irregular heart beat and maintains the steady beat needed for normal living. When a heart cannot pump enough blood through the lungs because of poorly functioning valves, the valves can be replaced with artificial ones of plastic and metal. For patients with coronary disease, 'by-pass surgery' is often used to repair clogged or damaged arteries. Doctors use pieces of a patient's own veins, often from the leg, to replace the damaged portions of arteries. Preventive care is also getting better as scientists learn more and more about the causes of heart disease. They have shown that diet can be an important means of controlling heart disease. For example, a substance called cholesterol is known to cause a build-up of fatty substances in the blood vessels, which can cause blood clots to form in the arteries. Therefore, doctors stress the importance of a diet low in cholesterol. Similarly, salt is known to increase blood pressure, so doctors recommend a low-salt diet for patients with high blood pressure",
        "propositions_high_knowledge": [
            "HARDWORKING(HEART, ORGAN)",
            "IN(HEART, BODY)",
            "RELY(WE, HEART)",
            "SUPPLY(HEART, BLOOD_REGULARLY)",
            "EVERY_MOMENT(WE, RELY)",
            "IS_THREAT_TO_LIFE(DISORDER_STOPPING_HEART)",
            "IS(HEART_DISEASE, DISORDER)",
            "COMMON(HEART_DISEASE)",
            "KILLS(HEART_DISEASE, MORE_PEOPLE)",
            "IN(HEART_DISEASE, U.S.)",
            "MORE_THAN(HEART_DISEASE, ANY_OTHER_DISEASE)",
            "ARE_KINDS(HEART_DISEASE, MANY)",
            "SOME(PRESENT_AT_BIRTH)",
            "SOME(ACQUIRED_LATER)",
            "IS(CONGENITAL_HEART_DISEASE, DEFECT)",
            "BORN_WITH(BABY, CONGENITAL_HEART_DISEASE)",
            "BORN_WITH(MOST_BABIES, PERFECT_HEARTS)",
            "BORN_WITH(ONE_IN_200_BABIES, BAD_HEART)",
            "HAVE(HEARTS, VALVES)",
            "CALLED(FLAPS, VALVES)",
            "CONTROL(VALVES, BLOOD_FLOW)",
            "BETWEEN(VALVES, HEART_CHAMBERS)",
            "DEVELOPS(VALVE, WRONG_SHAPE)",
            "TOO_TIGHT(VALVE)",
            "FAIL_TO_CLOSE(VALVE)",
            "RESULTS_IN(VALVE_DEFECT, CONGENITAL_HEART_DISEASE)",
            "IS_LEFT(GAP, SEPTAL_WALL)",
            "BETWEEN(GAP, HEART_SIDES)",
            "CALLED(CONGENITAL_HEART_DISEASE, SEPTAL_DEFECT)",
            "BADLY_SHAPED(BABY_HEART)",
            "CANNOT_WORK_EFFICIENTLY(BABY_HEART)",
            "CANNOT_PUMP_ENOUGH_BLOOD(BABY_HEART, LUNGS)",
            "CANNOT_RECEIVE_ENOUGH_OXYGEN(BABY_HEART)",
            "BECOMES(BABY, BREATHLESS)",
            "CANNOT_EXPEL_CO2(BLOOD, LUNGS)",
            "BECOMES(BLOOD, PURPLISH)",
            "CAUSES(BLOOD_COLOR, SKIN_LOOK_BLUE)",
            "POSSIBLE(SAVE_LIVES, BLUE_BABIES)",
            "ACQUIRED_AFTER_BIRTH(HEART_DISEASE)",
            "IS(RHEUMATIC_FEVER, ACQUIRED_DISEASE)",
            "CAUSES(RHEUMATIC_FEVER, DAMAGE_TO_HEART)",
            "FOLLOWS(RHEUMATIC_FEVER, SORE_THROAT)",
            "CAUSED_BY(SORE_THROAT, STREPTOCOCCI)",
            "CALLED(SORE_THROAT, STREP_THROAT)",
            "CAUSES(STREP_THROAT, RHEUMATIC_FEVER)",
            "BECOME_INFLAMED(HEART_TISSUES)",
            "IF_BADLY_AFFECTED(HEART, FAILS_SOON)",
            "RECOVERS(HEART)",
            "SEEN(DAMAGE_RESULTS, YEARS_LATER)",
            "LEAVES(RHEUMATIC_FEVER, SCARS_IN_VALVES)",
            "CANNOT_WORK_PROPERLY(VALVES)",
            "PUTS(STRAIN, HEART)",
            "MAY_FAIL(HEART)",
            "TAKES(EFFECTS_OF_FEVER, TWENTY_TO_THIRTY_YEARS)",
            "IS(CORONARY_DISEASE, ACQUIRED_HEART_DISEASE)",
            "AFFECTS(CORONARY_DISEASE, CORONARY_ARTERIES)",
            "EXTEND_ACROSS(CORONARY_ARTERIES, HEART)",
            "SUPPLY(CORONARY_ARTERIES, BLOOD_FROM_LUNGS)",
            "GIVE(CORONARY_ARTERIES, OXYGEN)",
            "NEEDS(HEART_MUSCLE, OXYGEN)",
            "CARRY_ON_WORKING(HEART_MUSCLE)",
            "BECOME_BLOCKED(CORONARY_ARTERIES)",
            "CAUSES(BLOCKAGE, MUSCLE_TISSUE_DEATH)",
            "LACK_OF_OXYGEN(CAUSE, MUSCLE_TISSUE_DEATH)",
            "HAS(PATIENT, HEART_ATTACK)",
            "CAN_BE_FATAL(HEART_ATTACK)",
            "CAUSED_BY(BLOCKAGE, BLOOD_CLOT)",
            "CALLED(BLOOD_CLOT, THROMBUS)",
            "CALLED(CLOT_IN_CORONARY_ARTERY, CORONARY_THROMBOSIS)",
            "IS(CORONARY_THROMBOSIS, CORRECT_NAME_FOR_HEART_ATTACK)",
            "NOT_FORM_CLOTS(BLOOD, NORMAL_ARTERIES)",
            "ABNORMAL(CORONARY_ARTERIES)",
            "BECOME(LUMPY_ROUGH_NARROW, ARTERY_WALLS)",
            "BREAK_OFF(LUMPS)",
            "FORM_CLOTS(LUMPS)",
            "STOP_BLOOD_FLOW(CLOTS, HEART)",
            "ARE(ARRHYTHMIA, ACQUIRED_HEART_DISEASE)",
            "ARE(ANGINA, ACQUIRED_HEART_DISEASE)",
            "ARE(HIGH_BLOOD_PRESSURE, ACQUIRED_HEART_DISEASE)",
            "IS(ARRHYTHMIA, INTERRUPTION_OF_HEART_BEAT)",
            "MEANS(ARRHYTHMIA, LACK_OF_RHYTHM)",
            "IS(ANGINA, SHARP_PAIN_IN_CHEST)",
            "SIMILAR_TO(ANGINA, PAIN_FROM_HEART_ATTACK)",
            "COMMON(HIGH_BLOOD_PRESSURE)",
            "PLACES(HIGH_BLOOD_PRESSURE, STRAIN_ON_HEART_AND_ORGANS)",
            "IF_NOT_TREATED(HIGH_BLOOD_PRESSURE, MAY_LEAD_TO_HEART_ATTACKS)",
            "MAY_LEAD(HIGH_BLOOD_PRESSURE, KIDNEY_FAILURE)",
            "MAY_LEAD(HIGH_BLOOD_PRESSURE, OTHER_SERIOUS_PROBLEMS)",
            "HAS_NO_SYMPTOMS(HIGH_BLOOD_PRESSURE)",
            "MAY_NOT_BE_AWARE(PERSON, HIGH_BLOOD_PRESSURE)",
            "UNLESS_MEASURED(BLOOD_PRESSURE)",
            "MADE_PROGRESS(MEDICAL_SCIENCE, TREATMENT_AND_PREVENTION_OF_HEART_DISEASE)",
            "SINCE(MID_1960S, PROGRESS)",
            "DEVELOPED(NEW_DRUGS, HEART_DISEASE_TREATMENT)",
            "DEVELOPED(NEW_SURGICAL_METHODS, HEART_DISEASE_TREATMENT)",
            "ARE(BETA_BLOCKERS, NEW_DRUGS)",
            "CALLED(CHEMICALS, BETA_BLOCKERS)",
            "LESSEN(BETA_BLOCKERS, AFTER_EFFECTS_OF_HEART_ATTACKS)",
            "PREVENT(BETA_BLOCKERS, SECOND_ATTACKS)",
            "LOWER(BETA_BLOCKERS, BLOOD_PRESSURE)",
            "DISSOLVE(OTHER_DRUGS, LUMPS)",
            "BREAK_OFF_FROM(LUMPS, ARTERY_WALLS)",
            "PREVENT(LUMPS, STOP_BLOOD_FLOW)",
            "RANGE(SURGICAL_TECHNIQUES, REPAIR_TO_REPLACEMENT)",
            "REPAIR(DAMAGED_PARTS, VALVES_OR_ARTERIES)",
            "REPLACE(DAMAGED_PARTS, VALVES_OR_ARTERIES)",
            "REPLACEMENT_OF(ENTIRE_HEART, SURGERY_OPTION)",
            "IF(DAMAGED_HEART, CANNOT_FUNCTION)",
            "REPLACED_BY(DAMAGED_HEART, MECHANICAL_OR_TRANSPLANT)",
            "MORE_OFTEN_USED(HEART_TRANSPLANT, MECHANICAL_HEART)",
            "REPLACES(HEALTHY_HEART_OF_DECEASED, DISEASED_HEART)",
            "IMPLANTED(MECHANICAL_DEVICES, HUMAN_BODIES)",
            "KEEP_FUNCTIONING(MECHANICAL_DEVICES, HEARTS)",
            "IS(PACEMAKER, MOST_COMMON_DEVICE)",
            "DOES_NOT_HEAL(PACEMAKER, DISEASED_HEART)",
            "RELIEVES(PACEMAKER, SYMPTOMS_OF_IRREGULAR_BEAT)",
            "MAINTAINS(PACEMAKER, STEADY_BEAT)",
            "NEEDED_FOR(STEADY_BEAT, NORMAL_LIVING)",
            "CANNOT_PUMP_ENOUGH_BLOOD(DAMAGED_HEART, LUNGS)",
            "REPLACED_WITH(VALVES, ARTIFICIAL_ONES)",
            "MADE_OF(ARTIFICIAL_VALVES, PLASTIC_AND_METAL)",
            "USED_FOR(BYPASS_SURGERY, CORONARY_DISEASE)",
            "REPAIR(BYPASS_SURGERY, DAMAGED_ARTERIES)",
            "USE(DOCTORS, PATIENTS_OWN_VEINS)",
            "FROM(VEINS, LEG)",
            "REPLACE(DOCTORS, DAMAGED_PORTIONS_OF_ARTERIES)",
            "IMPROVING(PREVENTIVE_CARE)",
            "LEARN_MORE(SCIENTISTS, CAUSES_OF_HEART_DISEASE)",
            "SHOWN(DIET, IMPORTANT_IN_CONTROL)",
            "CAUSES(CHOLESTEROL, BUILD_UP_OF_FATTY_SUBSTANCES)",
            "IN(BUILD_UP, BLOOD_VESSELS)",
            "CAN_CAUSE(BUILD_UP, BLOOD_CLOTS)",
            "STRESS(DOCTORS, LOW_CHOLESTEROL_DIET)",
            "INCREASES(SALT, BLOOD_PRESSURE)",
            "RECOMMEND(DOCTORS, LOW_SALT_DIET)"
        ],
        "recall": "The heart is a hardworking organ in the body. We rely on the heart to supply blood regularly, and we rely on it every moment. Any disorder stopping the heart is a threat to life. Heart disease is such a disorder. Heart disease is common, and it kills more people in the U.S. than any other disease. There are many kinds of heart disease. Some are present at birth, and some are acquired later. Congenital heart disease is a defect. A baby may be born with congenital heart disease, but most babies are born with perfect hearts. One in 200 babies is born with a bad heart. Hearts have valves, which are called flaps. These valves control blood flow between heart chambers. Sometimes, a valve develops in the wrong shape. It may be too tight or fail to close. Such a valve defect results in congenital heart disease. A gap may be left in the septal wall between the sides of the heart. This congenital heart disease is called a septal defect. A baby's heart may be badly shaped and cannot work efficiently. It cannot pump enough blood to the lungs or receive enough oxygen. As a result, the baby becomes breathless. If the blood cannot expel CO₂ in the lungs, it becomes purplish, which causes the skin to look blue. It is possible to save the lives of such blue babies. Heart disease acquired after birth includes rheumatic fever. Rheumatic fever is an acquired disease that causes damage to the heart. It follows a sore throat caused by streptococci, also called strep throat. Strep throat causes rheumatic fever. Heart tissues become inflamed. If the heart is badly affected, it may fail soon. The heart can recover, but damage results may be seen years later. Rheumatic fever leaves scars in the valves, and the valves cannot work properly. This puts strain on the heart, which may fail. The effects of the fever may take twenty to thirty years. Coronary disease is another acquired heart disease. It affects the coronary arteries, which extend across the heart. These arteries supply blood from the lungs and give oxygen to the heart muscle. The heart muscle needs oxygen to carry on working. If the coronary arteries become blocked, the blockage causes muscle tissue death due to a lack of oxygen. As a result, the patient has a heart attack, which can be fatal. The blockage may be caused by a blood clot called a thrombus. A clot in a coronary artery is called coronary thrombosis, which is the correct name for a heart attack. Normally, blood does not form clots in normal arteries. But in abnormal coronary arteries, the artery walls become lumpy, rough, and narrow. Lumps may break off and form clots, which stop the flow of blood to the heart. Other acquired heart diseases are arrhythmia, angina, and high blood pressure. Arrhythmia is an interruption of the heartbeat and means a lack of rhythm. Angina is a sharp pain in the chest, similar to the pain from a heart attack. High blood pressure is common. It places strain on the heart and other organs. If not treated, high blood pressure may lead to heart attacks, kidney failure, and other serious problems. High blood pressure may have no symptoms. A person may not be aware of having it unless blood pressure is measured. Medical science has made progress in the treatment and prevention of heart disease since the mid-1960s. New drugs and new surgical methods have been developed. Beta blockers are among the new drugs. These chemicals lessen the after-effects of heart attacks, prevent second attacks, and lower blood pressure. Other drugs dissolve lumps that break off from artery walls and prevent them from stopping blood flow. Surgical techniques range from repair to replacement. Damaged parts such as valves or arteries may be repaired or replaced. If a heart is so damaged that it cannot function, it can be replaced by a mechanical heart or more often by a heart transplant. In a transplant, the healthy heart of a deceased person replaces the heart of the patient. Mechanical devices can be implanted in human bodies to keep hearts functioning. The most common device is the pacemaker. A pacemaker does not heal the diseased heart but relieves symptoms of an irregular beat and maintains a steady beat. A steady beat is needed for normal living. A damaged heart that cannot pump enough blood to the lungs may have its valves replaced with artificial ones made of plastic and metal. For coronary disease, bypass surgery is used to repair damaged arteries. Doctors use the patient's own veins from the leg to replace the damaged portions of arteries. Preventive care is improving. Scientists are learning more about the causes of heart disease. Diet has been shown to be important in control. Cholesterol causes the build-up of fatty substances in blood vessels. This build-up can cause blood clots. Therefore, doctors stress a low-cholesterol diet. Salt increases blood pressure, so doctors recommend a low-salt diet.",
        "recalled propositions with same agent": [
            "HARDWORKING(HEART, ORGAN)",
            "IN(HEART, BODY)",
            "RELY(WE, HEART)",
            "SUPPLY(HEART, BLOOD_REGULARLY)",
            "EVERY_MOMENT(WE, RELY)",
            "IS_THREAT_TO_LIFE(DISORDER_STOPPING_HEART)",
            "IS(HEART_DISEASE, DISORDER)",
            "COMMON(HEART_DISEASE)",
            "KILLS(HEART_DISEASE, MORE_PEOPLE)",
            "IN(HEART_DISEASE, U.S.)",
            "MORE_THAN(HEART_DISEASE, ANY_OTHER_DISEASE)",
            "ARE_KINDS(HEART_DISEASE, MANY)",
            "SOME(PRESENT_AT_BIRTH)",
            "SOME(ACQUIRED_LATER)",
            "IS(CONGENITAL_HEART_DISEASE, DEFECT)",
            "BORN_WITH(BABY, CONGENITAL_HEART_DISEASE)",
            "BORN_WITH(MOST_BABIES, PERFECT_HEARTS)",
            "BORN_WITH(ONE_IN_200_BABIES, BAD_HEART)",
            "HAVE(HEARTS, VALVES)",
            "CALLED(VALVES, FLAPS)",
            "CONTROL(VALVES, BLOOD_FLOW)",
            "BETWEEN(VALVES, HEART_CHAMBERS)",
            "DEVELOPS(VALVE, WRONG_SHAPE)",
            "TOO_TIGHT(VALVE)",
            "FAIL_TO_CLOSE(VALVE)",
            "RESULTS_IN(VALVE_DEFECT, CONGENITAL_HEART_DISEASE)",
            "IS_LEFT(GAP, SEPTAL_WALL)",
            "BETWEEN(GAP, HEART_SIDES)",
            "CALLED(CONGENITAL_HEART_DISEASE, SEPTAL_DEFECT)",
            "BADLY_SHAPED(BABY_HEART)",
            "CANNOT_WORK_EFFICIENTLY(BABY_HEART)",
            "CANNOT_PUMP_ENOUGH_BLOOD(BABY_HEART, LUNGS)",
            "CANNOT_RECEIVE_ENOUGH_OXYGEN(BABY_HEART)",
            "BECOMES(BABY, BREATHLESS)",
            "CANNOT_EXPEL_CO2(BLOOD, LUNGS)",
            "BECOMES(BLOOD, PURPLISH)",
            "CAUSES(BLOOD_COLOR, SKIN_LOOK_BLUE)",
            "POSSIBLE(SAVE_LIVES, BLUE_BABIES)",
            "IS_ACQUIRED_AFTER_BIRTH(HEART_DISEASE)",
            "IS(RHEUMATIC_FEVER, ACQUIRED_DISEASE)",
            "CAUSES(RHEUMATIC_FEVER, DAMAGE_TO_HEART)",
            "FOLLOWS(RHEUMATIC_FEVER, SORE_THROAT)",
            "CAUSED_BY(SORE_THROAT, STREPTOCOCCI)",
            "CALLED(SORE_THROAT, STREP_THROAT)",
            "CAUSES(STREP_THROAT, RHEUMATIC_FEVER)",
            "BECOME_INFLAMED(HEART_TISSUES)",
            "IF_BADLY_AFFECTED(HEART, FAILS_SOON)",
            "RECOVERS(HEART)",
            "SEEN(DAMAGE_RESULTS, YEARS_LATER)",
            "LEAVES(RHEUMATIC_FEVER, SCARS_IN_VALVES)",
            "CANNOT_WORK_PROPERLY(VALVES)",
            "PUTS(STRAIN, HEART)",
            "MAY_FAIL(HEART)",
            "TAKES(EFFECTS_OF_FEVER, TWENTY_TO_THIRTY_YEARS)",
            "IS(CORONARY_DISEASE, ACQUIRED_HEART_DISEASE)",
            "AFFECTS(CORONARY_DISEASE, CORONARY_ARTERIES)",
            "EXTEND_ACROSS(CORONARY_ARTERIES, HEART)",
            "SUPPLY(CORONARY_ARTERIES, BLOOD_FROM_LUNGS)",
            "GIVE(CORONARY_ARTERIES, OXYGEN)",
            "NEEDS(HEART_MUSCLE, OXYGEN)",
            "CARRY_ON_WORKING(HEART_MUSCLE)",
            "BECOME_BLOCKED(CORONARY_ARTERIES)",
            "CAUSES(BLOCKAGE, MUSCLE_TISSUE_DEATH)",
            "LACK_OF_OXYGEN(CAUSE, MUSCLE_TISSUE_DEATH)",
            "HAS(PATIENT, HEART_ATTACK)",
            "CAN_BE_FATAL(HEART_ATTACK)",
            "CAUSED_BY(BLOCKAGE, BLOOD_CLOT)",
            "CALLED(BLOOD_CLOT, THROMBUS)",
            "CALLED(CLOT_IN_CORONARY_ARTERY, CORONARY_THROMBOSIS)",
            "IS(CORONARY_THROMBOSIS, CORRECT_NAME_FOR_HEART_ATTACK)",
            "NOT_FORM_CLOTS(BLOOD, NORMAL_ARTERIES)",
            "ABNORMAL(CORONARY_ARTERIES)",
            "BECOME(LUMPY_ROUGH_NARROW, ARTERY_WALLS)",
            "BREAK_OFF(LUMPS)",
            "FORM_CLOTS(LUMPS)",
            "STOP_BLOOD_FLOW(CLOTS, HEART)",
            "ARE(ARRHYTHMIA, ACQUIRED_HEART_DISEASE)",
            "ARE(ANGINA, ACQUIRED_HEART_DISEASE)",
            "ARE(HIGH_BLOOD_PRESSURE, ACQUIRED_HEART_DISEASE)",
            "IS(ARRHYTHMIA, INTERRUPTION_OF_HEART_BEAT)",
            "MEANS(ARRHYTHMIA, LACK_OF_RHYTHM)",
            "IS(ANGINA, SHARP_PAIN_IN_CHEST)",
            "SIMILAR_TO(ANGINA, PAIN_FROM_HEART_ATTACK)",
            "COMMON(HIGH_BLOOD_PRESSURE)",
            "PLACES(HIGH_BLOOD_PRESSURE, STRAIN_ON_HEART_AND_ORGANS)",
            "IF_NOT_TREATED(HIGH_BLOOD_PRESSURE, MAY_LEAD_TO_HEART_ATTACKS)",
            "MAY_LEAD(HIGH_BLOOD_PRESSURE, KIDNEY_FAILURE)",
            "MAY_LEAD(HIGH_BLOOD_PRESSURE, OTHER_SERIOUS_PROBLEMS)",
            "HAS_NO_SYMPTOMS(HIGH_BLOOD_PRESSURE)",
            "MAY_NOT_BE_AWARE(PERSON, HIGH_BLOOD_PRESSURE)",
            "UNLESS_MEASURED(BLOOD_PRESSURE)",
            "MADE_PROGRESS(MEDICAL_SCIENCE, TREATMENT_AND_PREVENTION)",
            "SINCE(MID_1960S, PROGRESS)",
            "DEVELOPED(NEW_DRUGS, HEART_DISEASE_TREATMENT)",
            "DEVELOPED(NEW_SURGICAL_METHODS, HEART_DISEASE_TREATMENT)",
            "ARE(BETA_BLOCKERS, NEW_DRUGS)",
            "CALLED(CHEMICALS, BETA_BLOCKERS)",
            "LESSEN(BETA_BLOCKERS, AFTER_EFFECTS_OF_HEART_ATTACKS)",
            "PREVENT(BETA_BLOCKERS, SECOND_ATTACKS)",
            "LOWER(BETA_BLOCKERS, BLOOD_PRESSURE)",
            "DISSOLVE(OTHER_DRUGS, LUMPS)",
            "BREAK_OFF_FROM(LUMPS, ARTERY_WALLS)",
            "PREVENT(LUMPS, STOP_BLOOD_FLOW)",
            "RANGE(SURGICAL_TECHNIQUES, REPAIR_TO_REPLACEMENT)",
            "REPAIR(DAMAGED_PARTS, VALVES_OR_ARTERIES)",
            "REPLACE(DAMAGED_PARTS, VALVES_OR_ARTERIES)",
            "IF(DAMAGED_HEART, CANNOT_FUNCTION)",
            "REPLACED_BY(DAMAGED_HEART, MECHANICAL_OR_TRANSPLANT)",
            "MORE_OFTEN_USED(HEART_TRANSPLANT, MECHANICAL_HEART)",
            "REPLACES(HEALTHY_HEART_OF_DECEASED, DISEASED_HEART)",
            "IMPLANTED(MECHANICAL_DEVICES, HUMAN_BODIES)",
            "KEEP_FUNCTIONING(MECHANICAL_DEVICES, HEARTS)",
            "IS(PACEMAKER, MOST_COMMON_DEVICE)",
            "DOES_NOT_HEAL(PACEMAKER, DISEASED_HEART)",
            "RELIEVES(PACEMAKER, SYMPTOMS_OF_IRREGULAR_BEAT)",
            "MAINTAINS(PACEMAKER, STEADY_BEAT)",
            "NEEDED_FOR(STEADY_BEAT, NORMAL_LIVING)",
            "CANNOT_PUMP_ENOUGH_BLOOD(DAMAGED_HEART, LUNGS)",
            "REPLACED_WITH(VALVES, ARTIFICIAL_ONES)",
            "MADE_OF(ARTIFICIAL_VALVES, PLASTIC_AND_METAL)",
            "USED_FOR(BYPASS_SURGERY, CORONARY_DISEASE)",
            "REPAIR(BYPASS_SURGERY, DAMAGED_ARTERIES)",
            "USE(DOCTORS, PATIENTS_OWN_VEINS)",
            "FROM(VEINS, LEG)",
            "REPLACE(DOCTORS, DAMAGED_PORTIONS_OF_ARTERIES)",
            "IMPROVING(PREVENTIVE_CARE)",
            "LEARN_MORE(SCIENTISTS, CAUSES_OF_HEART_DISEASE)",
            "SHOWN(DIET, IMPORTANT_IN_CONTROL)",
            "CAUSES(CHOLESTEROL, BUILD_UP_OF_FATTY_SUBSTANCES)",
            "IN(BUILD_UP, BLOOD_VESSELS)",
            "CAN_CAUSE(BUILD_UP, BLOOD_CLOTS)",
            "STRESS(DOCTORS, LOW_CHOLESTEROL_DIET)",
            "INCREASES(SALT, BLOOD_PRESSURE)",
            "RECOMMEND(DOCTORS, LOW_SALT_DIET)"
        ],  
        "recalled propositions with different agent": [
            "RELY(HUMANS, HEART)",
            "SUPPLY(HEART, BLOOD)",
            "CAUSE(DISORDER_STOPPING_HEART, LIFE_THREAT)",
            "COMMON(HEART_DISEASE)",
            "CAUSE(HEART_DISEASE, MOST_US_DEATHS)",
            "KIND_OF(HEART_DISEASE, CONGENITAL)",
            "KIND_OF(HEART_DISEASE, ACQUIRED)",
            "DEFECT(CON_GENITAL_HEART_DISEASE)",
            "PROBABILITY(BAD_HEART_AT_BIRTH, 1_IN_200)",
            "HAS(HEART, VALVES)",
            "CONTROL(VALVES, BLOOD_FLOW_BETWEEN_CHAMBERS)",
            "CAUSE(VALVE_WRONG_SHAPE, CONGENITAL_HEART_DISEASE)",
            "CAUSE(SEPTAL_GAP, SEPTAL_DEFECT)",
            "CAUSE(BAD_HEART_SHAPE, INEFFICIENT_WORK)",
            "CAUSE(INEFFICIENT_PUMPING, BREATHLESSNESS)",
            "CAUSE(CO2_RETAINED, PURPLISH_BLOOD)",
            "CAUSE(PURPLISH_BLOOD, BLUE_SKIN)",
            "POSSIBLE(SAVE_BLUE_BABIES)",
            "CAUSE(STREP_THROAT, RHEUMATIC_FEVER)",
            "CAUSE(RHEUMATIC_FEVER, HEART_DAMAGE)",
            "CAUSE(INFLAMMATION, HEART_FAILURE)",
            "CAUSE(RHEUMATIC_FEVER, VALVE_SCARS)",
            "CAUSE(VALVE_SCARS, IMPROPER_VALVE_FUNCTION)",
            "CAUSE(VALVE_DAMAGE, HEART_STRAIN)",
            "CAUSE(CORONARY_DISEASE, HEART_ATTACK)",
            "AFFECT(CORONARY_DISEASE, CORONARY_ARTERIES)",
            "SUPPLY(CORONARY_ARTERIES, OXYGEN_TO_HEART)",
            "CAUSE(ARTERY_BLOCKAGE, MUSCLE_TISSUE_DEATH)",
            "CAUSE(MUSCLE_TISSUE_DEATH, HEART_ATTACK)",
            "CAUSE(BLOOD_CLOT, BLOCKAGE)",
            "CAUSE(CLOT_CORONARY_ARTERY, CORONARY_THROMBOSIS)",
            "CAUSE(ABNORMAL_ARTERIES, CLOT_FORMATION)",
            "CAUSE(LUMP_BREAK_OFF, CLOT_FORMATION)",
            "KIND_OF(ACQUIRED_HEART_DISEASE, ARRHYTHMIA)",
            "KIND_OF(ACQUIRED_HEART_DISEASE, ANGINA)",
            "KIND_OF(ACQUIRED_HEART_DISEASE, HIGH_BLOOD_PRESSURE)",
            "CAUSE(ARRHYTHMIA, IRREGULAR_HEARTBEAT)",
            "CAUSE(ANGINA, CHEST_PAIN)",
            "CAUSE(HIGH_BLOOD_PRESSURE, HEART_STRUGGLE)",
            "CAUSE(HIGH_BLOOD_PRESSURE, HEART_ATTACK)",
            "CAUSE(HIGH_BLOOD_PRESSURE, KIDNEY_FAILURE)",
            "SYMPTOMLESS(HIGH_BLOOD_PRESSURE)",
            "REQUIRE(MEASUREMENT, BLOOD_PRESSURE_DETECTION)",
            "CAUSE(BETA_BLOCKERS, REDUCE_HEART_ATTACK_EFFECTS)",
            "PREVENT(BETA_BLOCKERS, SECOND_ATTACK)",
            "LOWER(BETA_BLOCKERS, BLOOD_PRESSURE)",
            "DISSOLVE(DRUGS, ARTERY_LUMPS)",
            "REPAIR(SURGERY, HEART_PARTS)",
            "REPLACE(SURGERY, HEART_PARTS)",
            "REPLACE(DAMAGED_HEART, MECHANICAL_HEART)",
            "REPLACE(DISEASED_HEART, DONOR_HEART)",
            "IMPLANT(DEVICES, HUMAN_BODY)",
            "COMMON(PACEMAKER)",
            "MAINTAIN(PACEMAKER, STEADY_BEAT)",
            "REPLACE(DAMAGED_VALVES, ARTIFICIAL_VALVES)",
            "MATERIAL(ARTIFICIAL_VALVES, PLASTIC_METAL)",
            "USE(BYPASS_SURGERY, REPAIR_ARTERIES)",
            "REPLACE(DAMAGED_ARTERIES, LEG_VEINS)",
            "IMPROVE(PREVENTIVE_CARE)",
            "STRESS(DOCTORS, LOW_CHOLESTEROL_DIET)",
            "CAUSE(CHOLESTEROL, FATTY_BUILDUP)",
            "CAUSE(FATTY_BUILDUP, BLOOD_CLOTS)",
            "INCREASE(SALT, BLOOD_PRESSURE)",
            "RECOMMEND(DOCTORS, LOW_SALT_DIET)"
        ],
        "propositions_low_knowledge": [
            "BE(HEART, HARDEST_WORKING_ORGAN)",
            "RELY(WE, SUPPLY(HEART, BLOOD))",
            "TIME(EVERY_MOMENT, RELY(WE, HEART))",
            "CAUSE(STOP(HEART_SUPPLY_BLOOD), LIFE_THREAT)",
            "IS(HEART_DISEASE, DISORDER)",
            "IS_COMMON(HEART_DISEASE)",
            "KILL(MORE_PEOPLE, HEART_DISEASE)",
            "IS_A(HEART_DISEASE, MANY_KINDS)",
            "SOME_PRESENT_AT_BIRTH(HEART_DISEASE)",
            "SOME_ACQUIRED_LATER(HEART_DISEASE)",
            "IS_A(CONGENITAL_HEART_DISEASE, DEFECT_AT_BIRTH)",
            "MOST_BABIES(BORN_WITH(PERFECT_HEARTS))",
            "ONE_IN_200_BABIES(BORN_WITH(BAD_HEART))",
            "HAS(HEART, VALVES)",
            "VALVES(CONTROL(BLOOD_FLOW, BETWEEN_HEART_CHAMBERS))",
            "DEVELOP(VALVE, WRONG_SHAPE)",
            "IS_CAUSE(WRONG_SHAPE_VALVE, CONGENITAL_HEART_DISEASE)",
            "MAY_BE(VALVE, TOO_TIGHT)",
            "MAY_FAIL(VALVE, CLOSE)",
            "LEAVE_GAP(SEPTUM)",
            "IS(SEPTAL_DEFECT, CONGENITAL_HEART_DISEASE)",
            "SHAPE_BADLY(BABY_HEART)",
            "CANNOT(BABY_HEART, WORK_EFFICIENTLY)",
            "CANNOT(PUMP_ENOUGH_BLOOD, BABY_HEART)",
            "CANNOT(RECEIVE_ENOUGH_OXYGEN, BABY_HEART)",
            "CAUSE(BABY, BREATHLESS)",
            "CANNOT(EXPEL_CO2, BLOOD)",
            "BECOME(BLOOD, PURPLISH)",
            "CAUSE(SKIN, LOOK_BLUE)",
            "POSSIBLE(SAVE(LIVES, BLUE_BABIES))",
            "IS_ACQUIRED(HEART_DISEASE, AFTER_BIRTH)",
            "EXAMPLE(RHEUMATIC_FEVER, ACQUIRED_HEART_DISEASE)",
            "FOLLOWS(RHEUMATIC_FEVER, STREP_THROAT)",
            "CAUSE(STREPTOCOCCI, STREP_THROAT)",
            "CAUSE(STREP_THROAT, RHEUMATIC_FEVER)",
            "CAUSE(RHEUMATIC_FEVER, HEART_TISSUE_INFLAMMATION)",
            "IF(BADLY_AFFECTED(HEART), FAIL_SOON)",
            "USUALLY(HEART, RECOVERS)",
            "RESULTS_VISIBLE(RHEUMATIC_FEVER_DAMAGE, YEARS_LATER)",
            "LEAVES_SCARS(RHEUMATIC_FEVER, HEART_VALVES)",
            "CANNOT_WORK_PROPERLY(HEART_VALVES)",
            "CAUSE(VALVE_SCARS, STRAIN_ON_HEART)",
            "MAY_FAIL(EVENTUALLY, HEART)",
            "TIMEFRAME(EFFECTS_VISIBLE, 20_TO_30_YEARS)",
            "EXAMPLE(CORONARY_DISEASE, ACQUIRED_HEART_DISEASE)",
            "AFFECT(CORONARY_DISEASE, CORONARY_ARTERIES)",
            "SUPPLY(CORONARY_ARTERIES, BLOOD_TO_HEART)",
            "GIVE(ARTERIES, OXYGEN_TO_HEART_MUSCLE)",
            "BLOCK(CORONARY_ARTERIES, CORONARY_DISEASE)",
            "CAUSE(BLOCKED_ARTERIES, HEART_MUSCLE_DIE)",
            "CAUSE(MUSCLE_DEATH, HEART_ATTACK)",
            "IS_FATAL(HEART_ATTACK)",
            "CAUSE(BLOOD_CLOT, ARTERY_BLOCKAGE)",
            "IS_A(CLOT, THROMBUS)",
            "IS(CLOT_IN_ARTERY, CORONARY_THROMBOSIS)",
            "IS(CORONARY_THROMBOSIS, HEART_ATTACK)",
            "DO_NOT_FORM_CLOTS(NORMAL_ARTERIES)",
            "ARE_NOT(NORMAL, ARTERIES_IN_DISEASE)",
            "BECOME(ARTERY_WALLS, LUMPY_AND_NARROW)",
            "BREAK_OFF(LUMPS, FORM_CLOTS)",
            "STOP(BLOOD_FLOW, CLOTS)",
            "OTHER_EXAMPLES(ACQUIRED_HEART_DISEASE, [ARRHYTHMIA, ANGINA, HIGH_BP])",
            "IS(ARRHYTHMIA, INTERRUPTED_HEARTBEAT)",
            "IS(ANGINA, CHEST_PAIN)",
            "RESEMBLE(ANGINA_PAIN, HEART_ATTACK)",
            "IS(HIGH_BP, COMMON_HEART_DISEASE)",
            "CAUSE(HIGH_BP, HEART_AND_ORGAN_STRAIN)",
            "IF_UNTREATED(HIGH_BP, LEAD_TO_PROBLEMS)",
            "NO_SYMPTOMS(HIGH_BP)",
            "ONLY_KNOWN_IF_MEASURED(HIGH_BP)",
            "PROGRESS(TREATMENT, SINCE_1960S)",
            "DEVELOP(NEW_DRUGS, TREAT_HEART_DISEASE)",
            "DEVELOP(NEW_SURGERY, TREAT_HEART_DISEASE)",
            "IS_A(BETA_BLOCKERS, NEW_DRUG)",
            "EFFECT(BETA_BLOCKERS, LESSEN_AFTER_EFFECTS)",
            "PREVENT(BETA_BLOCKERS, SECOND_ATTACKS)",
            "LOWER(BETA_BLOCKERS, HIGH_BP)",
            "DISSOLVE(DRUGS, ARTERY_LUMPS)",
            "PREVENT(DRUGS, BLOOD_BLOCKAGE)",
            "RANGE(SURGICAL_TECHNIQUES, [REPAIR_PARTS, REPLACE_PARTS, TRANSPLANT])",
            "REPLACE(DAMAGED_HEART, MECHANICAL_HEART)",
            "REPLACE(DISEASED_HEART, DONOR_HEART)",
            "IMPLANT(DEVICES, MAINTAIN_FUNCTION)",
            "IS(PACEMAKER, COMMON_DEVICE)",
            "RELIEVE(PACEMAKER, SYMPTOMS)",
            "MAINTAIN(PACEMAKER, STEADY_BEAT)",
            "REPLACE(DAMAGED_VALVES, ARTIFICIAL_VALVES)",
            "USE(BYPASS_SURGERY, REPAIR_ARTERIES)",
            "USE(PATIENT_VEINS, REPLACE_ARTERIES)",
            "IMPROVE(PREVENTION, BETTER_KNOWLEDGE)",
            "AFFECT(DIET, HEART_DISEASE)",
            "CAUSE(CHOLESTEROL, FATTY_BUILDUP)",
            "CAUSE(FATTY_BUILDUP, CLOTS)",
            "RECOMMEND(DOCTORS, LOW_CHOLESEROL_DIET)",
            "CAUSE(SALT, HIGH_BP)",
            "RECOMMEND(DOCTORS, LOW_SALT_DIET)"   
        ],
        "recall_low_proposition": "The heart is the hardest-working organ in the body. We rely on the heart to supply blood every moment. If the heart stops supplying blood, it causes a life-threatening situation. Heart disease is a disorder and is very common. It kills more people than any other disease. There are many kinds of heart disease. Some are present at birth, and some are acquired later. Congenital heart disease is a defect present at birth. Most babies are born with perfect hearts, but one in 200 babies is born with a bad heart. The heart has valves that control blood flow between its chambers. Sometimes a valve develops the wrong shape, which can cause congenital heart disease. A valve may be too tight or may fail to close. A gap may be left in the septum. This is called a septal defect. When a baby's heart is badly shaped, it cannot work efficiently. It may not pump enough blood or receive enough oxygen. As a result, the baby becomes breathless. The blood cannot expel carbon dioxide and becomes purplish, causing the skin to look blue. It is possible to save the lives of these \"blue babies.\" Heart disease can also be acquired after birth. Rheumatic fever is an example. It follows strep throat, which is caused by streptococci. Rheumatic fever can inflame heart tissues. If the heart is badly affected, it may fail soon, though it usually recovers. Damage from rheumatic fever may become visible years later. It can leave scars on heart valves, which then cannot work properly. These scars cause strain on the heart, which may eventually fail. These effects may appear 20 to 30 years later. Coronary disease is another example of acquired heart disease. It affects the coronary arteries, which supply blood and oxygen to the heart muscle. If the arteries are blocked, the heart muscle may die, causing a heart attack, which can be fatal. A blood clot can block the artery. This clot is called a thrombus. A clot in a coronary artery is called coronary thrombosis, which is a form of heart attack. Normally, arteries do not form clots. In disease, arteries are not normal; their walls become lumpy and narrow. Lumps can break off and form clots, which stop blood flow. Other acquired heart diseases include arrhythmia, angina, and high blood pressure. Arrhythmia is an interrupted heartbeat. Angina is chest pain that resembles a heart attack. High blood pressure is a common heart disease. It causes strain on the heart and other organs. If untreated, it can lead to serious problems. High blood pressure usually has no symptoms and is only known if measured. Since the 1960s, treatment has progressed. New drugs and new surgeries have been developed. Beta blockers are a new drug. They lessen after-effects, prevent second attacks, and lower high blood pressure. Some drugs dissolve artery lumps and prevent blood blockages. Surgical techniques include repairing or replacing parts or even transplanting the entire heart. A damaged heart can be replaced by a mechanical heart or a donor heart. Devices can be implanted to maintain heart function. The pacemaker is a common device that relieves symptoms and maintains a steady beat. Damaged valves can be replaced with artificial ones. Bypass surgery uses the patient's veins to replace blocked arteries. Prevention has improved due to better knowledge. Diet affects heart disease. Cholesterol causes fatty buildup, which can lead to clots. Doctors recommend a low-cholesterol diet. Salt can cause high blood pressure, so doctors recommend a low-salt diet.",
        "low_propositions_recalled_propositions": [
            "BE(HEART, HARDEST_WORKING_ORGAN)",
            "RELY(WE, SUPPLY(HEART, BLOOD))",
            "TIME(EVERY_MOMENT, RELY(WE, HEART))",
            "CAUSE(STOP(SUPPLY(HEART, BLOOD)), LIFE_THREAT)",
            "IS(HEART_DISEASE, DISORDER)",
            "IS_COMMON(HEART_DISEASE)",
            "KILL(MORE_PEOPLE, HEART_DISEASE)",
            "HAS(HEART_DISEASE, MANY_KINDS)",
            "SOME_PRESENT_AT_BIRTH(HEART_DISEASE)",
            "SOME_ACQUIRED_LATER(HEART_DISEASE)",
            "IS(CONGENITAL_HEART_DISEASE, DEFECT_AT_BIRTH)",
            "BORN_WITH(MOST_BABIES, PERFECT_HEARTS)",
            "BORN_WITH(ONE_IN_200_BABIES, BAD_HEART)",
            "HAS(HEART, VALVES)",
            "CONTROL(VALVES, BLOOD_FLOW_BETWEEN_CHAMBERS)",
            "DEVELOP(VALVE, WRONG_SHAPE)",
            "CAUSE(WRONG_SHAPE(VALVE), CONGENITAL_HEART_DISEASE)",
            "TOO_TIGHT(VALVE)",
            "FAIL_TO_CLOSE(VALVE)",
            "LEAVE_GAP(SEPTUM)",
            "IS(SEPTAL_DEFECT, CONGENITAL_HEART_DISEASE)",
            "SHAPE_BADLY(BABY_HEART)",
            "CANNOT_WORK_EFFICIENTLY(BABY_HEART)",
            "CANNOT_PUMP_ENOUGH_BLOOD(BABY_HEART)",
            "CANNOT_RECEIVE_ENOUGH_OXYGEN(BABY_HEART)",
            "CAUSE(BABY, BREATHLESS)",
            "CANNOT_EXPEL_CO2(BLOOD)",
            "BECOME(BLOOD, PURPLISH)",
            "CAUSE(PURPLISH_BLOOD, BLUE_SKIN)",
            "POSSIBLE(SAVE(BLUE_BABIES))",
            "IS_ACQUIRED(HEART_DISEASE, AFTER_BIRTH)",
            "IS(RHEUMATIC_FEVER, ACQUIRED_HEART_DISEASE)",
            "FOLLOWS(RHEUMATIC_FEVER, STREP_THROAT)",
            "CAUSE(STREPTOCOCCI, STREP_THROAT)",
            "CAUSE(STREP_THROAT, RHEUMATIC_FEVER)",
            "CAUSE(RHEUMATIC_FEVER, INFLAMMATION(HEART_TISSUE))",
            "IF(BADLY_AFFECTED(HEART), MAY_FAIL_SOON(HEART))",
            "USUALLY(RECOVER(HEART))",
            "VISIBLE_LATER(RHEUMATIC_FEVER_DAMAGE, YEARS)",
            "LEAVE_SCARS(RHEUMATIC_FEVER, HEART_VALVES)",
            "CANNOT_WORK_PROPERLY(HEART_VALVES)",
            "CAUSE(SCARS, STRAIN_ON_HEART)",
            "MAY_FAIL(EVENTUALLY, HEART)",
            "IS(CORONARY_DISEASE, ACQUIRED_HEART_DISEASE)",
            "AFFECT(CORONARY_DISEASE, CORONARY_ARTERIES)",
            "SUPPLY(CORONARY_ARTERIES, BLOOD_TO_HEART)",
            "SUPPLY(CORONARY_ARTERIES, OXYGEN_TO_HEART_MUSCLE)",
            "BLOCK(CORONARY_ARTERIES, CORONARY_DISEASE)",
            "CAUSE(BLOCKED_ARTERIES, DIE(HEART_MUSCLE))",
            "CAUSE(DEAD_MUSCLE, HEART_ATTACK)",
            "IS_FATAL(HEART_ATTACK)",
            "CAUSE(BLOOD_CLOT, BLOCKAGE(ARTERY))",
            "IS_A(CLOT, THROMBUS)",
            "IS(CLOT_IN_CORONARY_ARTERY, CORONARY_THROMBOSIS)",
            "IS(CORONARY_THROMBOSIS, HEART_ATTACK)",
            "NOT_FORM_CLOTS(NORMAL_ARTERIES)",
            "ARE_NOT(NORMAL, DISEASED_ARTERIES)",
            "BECOME(ARTERY_WALLS, LUMPY_AND_NARROW)",
            "BREAK_OFF(LUMPS, FORM_CLOTS)",
            "STOP(CLOTS, BLOOD_FLOW)",
            "IS(ARRHYTHMIA, ACQUIRED_HEART_DISEASE)",
            "IS(ARRHYTHMIA, INTERRUPTED_HEARTBEAT)",
            "IS(ANGINA, CHEST_PAIN)",
            "RESEMBLE(ANGINA_PAIN, HEART_ATTACK)",
            "IS(HIGH_BP, COMMON_HEART_DISEASE)",
            "CAUSE(HIGH_BP, STRAIN(HEART_AND_ORGANS))",
            "IF_UNTREATED(HIGH_BP, LEAD_TO_PROBLEMS)",
            "NO_SYMPTOMS(HIGH_BP)",
            "ONLY_KNOWN_IF_MEASURED(HIGH_BP)",
            "PROGRESS(TREATMENT, SINCE_1960S)",
            "DEVELOP(NEW_DRUGS, TREAT(HEART_DISEASE))",
            "DEVELOP(NEW_SURGERIES, TREAT(HEART_DISEASE))",
            "IS(BETA_BLOCKERS, NEW_DRUG)",
            "LESSEN_AFTER_EFFECTS(BETA_BLOCKERS)",
            "PREVENT_SECOND_ATTACKS(BETA_BLOCKERS)",
            "LOWER(BETA_BLOCKERS, HIGH_BP)",
            "DISSOLVE(DRUGS, LUMPS_IN_ARTERIES)",
            "PREVENT(DRUGS, BLOOD_BLOCKAGE)",
            "INCLUDE(SURGICAL_TECHNIQUES, [REPAIR, REPLACE, TRANSPLANT])",
            "REPLACE(DAMAGED_HEART, MECHANICAL_HEART)",
            "REPLACE(DISEASED_HEART, DONOR_HEART)",
            "IMPLANT(DEVICES, MAINTAIN_FUNCTION)",
            "IS(PACEMAKER, DEVICE)",
            "RELIEVE(PACEMAKER, SYMPTOMS)",
            "MAINTAIN(PACEMAKER, STEADY_BEAT)",
            "REPLACE(DAMAGED_VALVES, ARTIFICIAL_VALVES)",
            "USE(BYPASS_SURGERY, REPAIR_ARTERIES)",
            "USE(PATIENT_VEINS, REPLACE_ARTERIES)",
            "IMPROVE(PREVENTION, BETTER_KNOWLEDGE)",
            "AFFECT(DIET, HEART_DISEASE)",
            "CAUSE(CHOLESTEROL, FATTY_BUILDUP)",
            "CAUSE(FATTY_BUILDUP, CLOTS)",
            "RECOMMEND(DOCTORS, LOW_CHOLESTEROL_DIET)",
            "CAUSE(SALT, HIGH_BP)",
            "RECOMMEND(DOCTORS, LOW_SALT_DIET)"
        ]
    },
    {
        "text title": "Heart Disease",
        "coherence": "Minimally Coherent",
        "texts": "The heart is the hardest-working organ in the body. We rely on a regular blood supply every moment of every day. Any disorder that stops the blood supply is a threat to life. Heart disease is very common. More people are killed every year in the U.S. by heart disease than by any other disease. A congenital disease is one that a person is born with. Most babies are born with perfect hearts. In about one in every 200 cases something goes wrong. Sometimes a valve develops the wrong shape. It may be too tight, or fail to close properly. Sometimes a gap is left in the septal wall between the two sides of the heart. This is often called a septal defect. When a baby's heart is badly formed, it cannot work efficiently. The blood does not receive enough oxygen. The baby becomes breathless. The blood cannot get rid of carbon dioxide through the lungs. It becomes purplish, and the baby's skin looks blue. It is now possible to save the lives of many blue babies. The disease called rheumatic fever may cause harm to the heart. The disease usually follows a sore throat caused by bacteria called streptococci. The tissues of the heart become inflamed. If it is badly affected, it fails. Usually it recovers, and the results of the damage are seen only years later. The valves of the heart are left with scars. They cannot work properly. This puts a strain on the heart. Eventually it may fail. The effects of the rheumatic fever may take up to twenty or thirty years to appear. The blood vessels that extend across the heart and supply it with blood are called the coronary arteries. They are very important. They give the heart the oxygen it needs to carry on working. If they become blocked, parts of the heart muscle will die. The patient has a heart attack, which can be fatal. The blockage of a coronary artery is usually caused by a thrombus, or blood clot. Coronary thrombosis happens when a clot forms in a coronary artery. That is the correct name for a heart attack. In normal arteries, blood does not form clots. In coronary disease, the walls of the blood vessels become lumpy, rough, and narrow. Arrhythmia is an interruption of the heart's normal beat. Angina is a sharp pain in the chest which is very similar to that caused by thrombosis. High blood pressure is very common. If untreated, high blood pressure may lead to heart attacks, kidney failure, or other serious problems. High blood pressure may have no symptoms. A person may not be aware of having it unless the blood pressure is measured. Among the new drugs for treating heart disease are a family of compounds called beta blocking drugs, or simply, beta blockers. They lessen the after-effects of heart attacks, can prevent second attacks, and can lower the blood pressure of people who have high blood pressure. Other drugs dissolve the lumps which break off the walls of veins and arteries. Heart transplants are used more often than mechanical hearts. In transplant surgery, the healthy heart of someone who has died replaces the heart of the patient. Mechanical devices can be implanted in people's bodies to keep their hearts functioning. The commonly used pacemaker does not heal the diseased heart, but it relieves the symptoms of an irregular heart and keeps a steady beat for normal living. When a heart cannot pump enough blood through the lungs because of poorly functioning valves, the valves can be replaced with artificial ones of plastic and metal. By-pass surgery is used to repair clogged or damaged blood vessels. Doctors use pieces of a patient's own veins, often from the leg, to replace the damaged portions of arteries. A substance called cholesterol is known to cause a build-up of fatty substances in the blood vessels, which can lead to heart disease, so doctors stress the importance of a diet low in fats. Salt is known to increase the blood pressure, so a low-salt diet is recommended.",
        "propositions_high_knowledge": [
            "HARDWORKING(HEART, ORGAN)",
            "IN(HEART, BODY)",
            "RELY(WE, BLOOD_SUPPLY)",
            "IS(DISORDER, THREAT_TO_LIFE)",
            "COMMON(HEART_DISEASE)",
            "KILL(HEART_DISEASE, PEOPLE)",
            "IS(CONGENITAL_DISEASE, DISEASE)",
            "BORN_WITH(PERSON, CONGENITAL_DISEASE)",
            "BORN_WITH(MOST_BABIES, PERFECT_HEARTS)",
            "GOES_WRONG(SOMETHING, CASE)",
            "DEVELOPS(VALVE, WRONG_SHAPE)",
            "TOO_TIGHT(VALVE)",
            "FAIL_TO_CLOSE(VALVE)",
            "IS_LEFT(GAP, SEPTAL_WALL)",
            "IS_CALLED(GAP, SEPTAL_DEFECT)",
            "IS_FORMED_BADLY(BABY_HEART)",
            "CANNOT_WORK_EFFICIENTLY(BABY_HEART)",
            "NOT_RECEIVE(BLOOD, OXYGEN)",
            "BECOMES(BABY, BREATHLESS)",
            "CANNOT_EXPEL(BLOOD, CARBON_DIOXIDE)",
            "BECOMES(BLOOD, PURPLISH)",
            "LOOKS(SKIN, BLUE)",
            "POSSIBLE(SAVE(LIVES, BLUE_BABIES))",
            "CAUSE(RHEUMATIC_FEVER, HARM_HEART)",
            "FOLLOWS(RHEUMATIC_FEVER, SORE_THROAT)",
            "CAUSED_BY(SORE_THROAT, STREPTOCOCCI)",
            "BECOME_INFLAMED(TISSUES_OF_HEART)",
            "IS_AFFECTED_BADLY(HEART)",
            "FAIL(HEART)",
            "RECOVERS(HEART)",
            "SEEN(DAMAGE_RESULTS, YEARS_LATER)",
            "LEFT_WITH(VALVES, SCARS)",
            "CANNOT_WORK_PROPERLY(VALVES)",
            "PUTS(STRAIN, HEART)",
            "MAY_FAIL(HEART)",
            "TAKES(EFFECTS_OF_FEVER, TWENTY_TO_THIRTY_YEARS)",
            "CALLED(BLOOD_VESSELS_SUPPLYING_HEART, CORONARY_ARTERIES)",
            "EXTEND_ACROSS(BLOOD_VESSELS, HEART)",
            "SUPPLY(BLOOD_VESSELS, BLOOD)",
            "IMPORTANT(CORONARY_ARTERIES)",
            "GIVE(CORONARY_ARTERIES, OXYGEN)",
            "NEEDS(HEART, OXYGEN)",
            "CARRY_ON_WORKING(HEART)",
            "BECOME_BLOCKED(CORONARY_ARTERIES)",
            "WILL_DIE(PARTS_OF_HEART_MUSCLE)",
            "HAS(PATIENT, HEART_ATTACK)",
            "CAN_BE_FATAL(HEART_ATTACK)",
            "CAUSED_BY(BLOCKAGE, THROMBUS)",
            "IS(THROMBUS, BLOOD_CLOT)",
            "HAPPENS(CORONARY_THROMBOSIS, CLOT_IN_ARTERY)",
            "IS(CORRECT_NAME_FOR_HEART_ATTACK, CORONARY_THROMBOSIS)",
            "NOT_FORM_CLOTS(BLOOD, NORMAL_ARTERIES)",
            "BECOME(LUMPY_ROUGH_NARROW, WALLS_OF_BLOOD_VESSELS_IN_DISEASE)",
            "IS(ARRHYTHMIA, INTERRUPTION_OF_HEART_BEAT)",
            "IS(ANGINA, SHARP_PAIN)",
            "SIMILAR_TO(ANGINA, PAIN_FROM_THROMBOSIS)",
            "COMMON(HIGH_BLOOD_PRESSURE)",
            "IF_UNTREATED(HIGH_BLOOD_PRESSURE, MAY_LEAD_TO_HEART_ATTACKS)",
            "MAY_LEAD(HIGH_BLOOD_PRESSURE, KIDNEY_FAILURE)",
            "MAY_LEAD(HIGH_BLOOD_PRESSURE, OTHER_SERIOUS_PROBLEMS)",
            "MAY_HAVE_NO_SYMPTOMS(HIGH_BLOOD_PRESSURE)",
            "MAY_NOT_BE_AWARE(PERSON, HIGH_BLOOD_PRESSURE)",
            "UNLESS_MEASURED(BLOOD_PRESSURE)",
            "ARE_NEW_DRUGS(BETA_BLOCKERS)",
            "CALLED(BETA_BLOCKING_DRUGS, BETA_BLOCKERS)",
            "LESSEN(BETA_BLOCKERS, AFTER_EFFECTS_OF_HEART_ATTACKS)",
            "PREVENT(BETA_BLOCKERS, SECOND_ATTACKS)",
            "LOWER(BETA_BLOCKERS, BLOOD_PRESSURE)",
            "DISSOLVE(OTHER_DRUGS, LUMPS)",
            "BREAK_OFF_FROM(LUMPS, WALLS_OF_VEINS_AND_ARTERIES)",
            "USED_MORE_OFTEN(HEART_TRANSPLANTS, MECHANICAL_HEARTS)",
            "REPLACES(HEALTHY_HEART_OF_DECEASED, HEART_OF_PATIENT)",
            "CAN_BE_IMPLANTED(MECHANICAL_DEVICES, HUMAN_BODIES)",
            "KEEP_FUNCTIONING(MECHANICAL_DEVICES, HEARTS)",
            "DOES_NOT_HEAL(PACEMAKER, DISEASED_HEART)",
            "RELIEVES(PACEMAKER, SYMPTOMS_OF_IRREGULAR_HEART)",
            "KEEPS(PACEMAKER, STEADY_BEAT)",
            "FOR(LIVING, NORMAL)",
            "CANNOT_PUMP_ENOUGH_BLOOD(HEART, LUNGS)",
            "CAUSE(POORLY_FUNCTIONING_VALVES, BLOOD_PUMP_FAILURE)",
            "REPLACED_WITH(VALVES, ARTIFICIAL_ONES)",
            "MADE_OF(ARTIFICIAL_VALVES, PLASTIC_AND_METAL)",
            "USED_TO_REPAIR(BYPASS_SURGERY, CLOGGED_OR_DAMAGED_VESSELS)",
            "USE(DOCTORS, PATIENTS_OWN_VEINS)",
            "FROM(VEINS, LEG)",
            "REPLACE(DOCTORS, DAMAGED_PORTIONS_OF_ARTERIES)",
            "CAUSES(CHOLESTEROL, BUILD_UP_OF_FATTY_SUBSTANCES)",
            "IN(BUILD_UP, BLOOD_VESSELS)",
            "CAN_LEAD_TO(BUILD_UP, HEART_DISEASE)",
            "STRESS(DOCTORS, IMPORTANCE_OF_LOW_FAT_DIET)",
            "INCREASES(SALT, BLOOD_PRESSURE)",
            "RECOMMENDED(LOW_SALT_DIET)"
        ],
        "recall": "The heart is a hardworking organ in the body. We rely on the heart for blood supply, and any disorder is a threat to life. Heart disease is common and kills many people. Congenital disease is a type of disease, and a person may be born with congenital disease, though most babies are born with perfect hearts. Sometimes something goes wrong. A valve may develop the wrong shape, becoming too tight or failing to close. A gap may be left in the septal wall, and this is called a septal defect. A baby's heart may be formed badly and cannot work efficiently. The baby's heart may not pump enough blood to the lungs or receive enough oxygen. As a result, the baby becomes breathless. The blood cannot expel carbon dioxide and becomes purplish. The skin then looks blue. It is possible to save the lives of blue babies. Rheumatic fever can cause harm to the heart and often follows a sore throat, which is caused by streptococci. The tissues of the heart become inflamed, and the heart is affected badly. Sometimes the heart may fail, or it may recover. Damage results can be seen years later. The valves may be left with scars and cannot work properly, which puts a strain on the heart, and the heart may fail. The effects of the fever may take twenty to thirty years. The blood vessels supplying the heart are called coronary arteries. These blood vessels extend across the heart and supply blood. Coronary arteries are important because they give oxygen to the heart, which needs oxygen to carry on working. If the coronary arteries become blocked, parts of the heart muscle will die, and the patient has a heart attack. A heart attack can be fatal. It is caused by blockage from a thrombus, which is a blood clot. Coronary thrombosis happens when there is a clot in the artery, and this is the correct name for a heart attack. Normally, blood does not form clots in normal arteries, but in disease, the walls of blood vessels become lumpy, rough, and narrow. Arrhythmia is an interruption of the heartbeat. Angina is a sharp pain and is similar to pain from thrombosis. High blood pressure is common and, if untreated, may lead to heart attacks, kidney failure, and other serious problems. High blood pressure may have no symptoms, and a person may not be aware of it unless blood pressure is measured. There are new drugs called beta blockers. Beta blocking drugs lessen the after-effects of heart attacks, prevent second attacks, and lower blood pressure. Other drugs dissolve lumps that break off from the walls of veins and arteries. Heart transplants are used more often than mechanical hearts. In a transplant, the healthy heart of a deceased person replaces the heart of a patient. Mechanical devices can be implanted in human bodies to keep hearts functioning. A pacemaker does not heal a diseased heart, but it relieves the symptoms of an irregular heart and keeps a steady beat for normal living. When the heart cannot pump enough blood to the lungs, poorly functioning valves may be the cause. Valves can be replaced with artificial ones made of plastic and metal. Bypass surgery is used to repair clogged or damaged vessels. Doctors may use the patient's own veins from the leg to replace damaged portions of arteries. Cholesterol causes a build-up of fatty substances in blood vessels, and this build-up can lead to heart disease. Doctors stress the importance of a low-fat diet. Salt increases blood pressure, so a low-salt diet is recommended.",
        "recalled propositions with different agent": [
            "HARDWORKING(HEART, ORGAN)",
            "IN(HEART, BODY)",
            "RELY(WE, BLOOD_SUPPLY)",
            "IS(DISORDER, THREAT_TO_LIFE)",
            "COMMON(HEART_DISEASE)",
            "KILL(HEART_DISEASE, PEOPLE)",
            "IS(CONGENITAL_DISEASE, DISEASE)",
            "BORN_WITH(PERSON, CONGENITAL_DISEASE)",
            "BORN_WITH(MOST_BABIES, PERFECT_HEARTS)",
            "GOES_WRONG(SOMETHING)",
            "DEVELOP(VALVE, WRONG_SHAPE)",
            "TOO_TIGHT(VALVE)",
            "FAIL_TO_CLOSE(VALVE)",
            "IS_LEFT(GAP, SEPTAL_WALL)",
            "IS_CALLED(GAP, SEPTAL_DEFECT)",
            "IS_FORMED_BADLY(BABY_HEART)",
            "CANNOT_WORK_EFFICIENTLY(BABY_HEART)",
            "CANNOT_PUMP(BABY_HEART, ENOUGH_BLOOD_TO_LUNGS)",
            "NOT_RECEIVE(BABY_HEART, ENOUGH_OXYGEN)",
            "BECOMES(BABY, BREATHLESS)",
            "CANNOT_EXPEL(BLOOD, CARBON_DIOXIDE)",
            "BECOMES(BLOOD, PURPLISH)",
            "LOOKS(SKIN, BLUE)",
            "POSSIBLE(SAVE(BLUE_BABIES))",
            "CAUSE(RHEUMATIC_FEVER, HARM(HEART))",
            "FOLLOWS(RHEUMATIC_FEVER, SORE_THROAT)",
            "CAUSED_BY(SORE_THROAT, STREPTOCOCCI)",
            "BECOME_INFLAMED(TISSUES_OF_HEART)",
            "IS_AFFECTED_BADLY(HEART)",
            "MAY_FAIL(HEART)",
            "MAY_RECOVER(HEART)",
            "SEEN(DAMAGE_RESULTS, YEARS_LATER)",
            "LEFT_WITH(VALVES, SCARS)",
            "CANNOT_WORK_PROPERLY(VALVES)",
            "PUTS(STRAIN, HEART)",
            "MAY_FAIL(HEART)",
            "TAKES(EFFECTS_OF_FEVER, TWENTY_TO_THIRTY_YEARS)",
            "CALLED(BLOOD_VESSELS_SUPPLYING_HEART, CORONARY_ARTERIES)",
            "EXTEND_ACROSS(CORONARY_ARTERIES, HEART)",
            "SUPPLY(CORONARY_ARTERIES, BLOOD)",
            "IMPORTANT(CORONARY_ARTERIES)",
            "GIVE(CORONARY_ARTERIES, OXYGEN)",
            "NEEDS(HEART, OXYGEN)",
            "CARRY_ON_WORKING(HEART)",
            "BECOME_BLOCKED(CORONARY_ARTERIES)",
            "WILL_DIE(PARTS_OF_HEART_MUSCLE)",
            "HAS(PATIENT, HEART_ATTACK)",
            "CAN_BE_FATAL(HEART_ATTACK)",
            "CAUSED_BY(HEART_ATTACK, BLOCKAGE)",
            "IS(BLOCKAGE, THROMBUS)",
            "IS(THROMBUS, BLOOD_CLOT)",
            "HAPPENS(CORONARY_THROMBOSIS, CLOT_IN_ARTERY)",
            "IS(CORONARY_THROMBOSIS, CORRECT_NAME_FOR_HEART_ATTACK)",
            "NOT_FORM_CLOTS(BLOOD, NORMAL_ARTERIES)",
            "BECOME(WALLS_OF_BLOOD_VESSELS, LUMPY_ROUGH_NARROW)",
            "IS(ARRHYTHMIA, INTERRUPTION_OF_HEARTBEAT)",
            "IS(ANGINA, SHARP_PAIN)",
            "SIMILAR_TO(ANGINA, PAIN_FROM_THROMBOSIS)",
            "COMMON(HIGH_BLOOD_PRESSURE)",
            "IF_UNTREATED(HIGH_BLOOD_PRESSURE, MAY_LEAD_TO_HEART_ATTACKS)",
            "MAY_LEAD(HIGH_BLOOD_PRESSURE, KIDNEY_FAILURE)",
            "MAY_LEAD(HIGH_BLOOD_PRESSURE, OTHER_SERIOUS_PROBLEMS)",
            "MAY_HAVE_NO_SYMPTOMS(HIGH_BLOOD_PRESSURE)",
            "MAY_NOT_BE_AWARE(PERSON, HIGH_BLOOD_PRESSURE)",
            "UNLESS_MEASURED(BLOOD_PRESSURE)",
            "ARE_NEW_DRUGS(BETA_BLOCKERS)",
            "CALLED(BETA_BLOCKING_DRUGS, BETA_BLOCKERS)",
            "LESSEN(BETA_BLOCKERS, AFTER_EFFECTS_OF_HEART_ATTACKS)",
            "PREVENT(BETA_BLOCKERS, SECOND_ATTACKS)",
            "LOWER(BETA_BLOCKERS, BLOOD_PRESSURE)",
            "DISSOLVE(OTHER_DRUGS, LUMPS)",
            "BREAK_OFF_FROM(LUMPS, WALLS_OF_VEINS_AND_ARTERIES)",
            "USED_MORE_OFTEN(HEART_TRANSPLANTS, MECHANICAL_HEARTS)",
            "REPLACE(HEALTHY_HEART_OF_DECEASED, HEART_OF_PATIENT)",
            "CAN_BE_IMPLANTED(MECHANICAL_DEVICES, HUMAN_BODIES)",
            "KEEP_FUNCTIONING(MECHANICAL_DEVICES, HEARTS)",
            "DOES_NOT_HEAL(PACEMAKER, DISEASED_HEART)",
            "RELIEVES(PACEMAKER, SYMPTOMS_OF_IRREGULAR_HEART)",
            "KEEPS(PACEMAKER, STEADY_BEAT)",
            "FOR(NORMAL, LIVING)",
            "CANNOT_PUMP_ENOUGH_BLOOD(HEART, LUNGS)",
            "CAUSE(POORLY_FUNCTIONING_VALVES, BLOOD_PUMP_FAILURE)",
            "REPLACED_WITH(VALVES, ARTIFICIAL_ONES)",
            "MADE_OF(ARTIFICIAL_VALVES, PLASTIC_AND_METAL)",
            "USED_TO_REPAIR(BYPASS_SURGERY, CLOGGED_OR_DAMAGED_VESSELS)",
            "USE(DOCTORS, PATIENTS_OWN_VEINS)",
            "FROM(VEINS, LEG)",
            "REPLACE(DOCTORS, DAMAGED_PORTIONS_OF_ARTERIES)",
            "CAUSES(CHOLESTEROL, BUILD_UP_OF_FATTY_SUBSTANCES)",
            "IN(BUILD_UP, BLOOD_VESSELS)",
            "CAN_LEAD_TO(BUILD_UP, HEART_DISEASE)",
            "STRESS(DOCTORS, IMPORTANCE_OF_LOW_FAT_DIET)",
            "INCREASES(SALT, BLOOD_PRESSURE)",
            "RECOMMENDED(LOW_SALT_DIET)"
        ],
        "recalled propositions with same agent": [
            "CAUSE(CHOLESTEROL, BUILD_UP_FATTY_SUBSTANCES)",
            "CAUSE(BUILD_UP, HEART_DISEASE)",
            "CAUSE(SALT, INCREASE_BLOOD_PRESSURE,_SO_A_LOW-SALT_DIET_IS_RECOMMENDED)",
            "CAUSE(HIGH_BLOOD_PRESSURE, HEART_ATTACKS)",
            "CAUSE(BLOCKED_ARTERIES, HEART_MUSCLE_DEATH)",
            "CAUSE(RHEUMATIC_FEVER, H)",
            "CAUSE(VALVE_MALFORMATION, BLOOD_FLOW_PROBLEM)",
            "CAUSE(GAP_SEPTAL_WALL, SEPTAL_DEFECT)",
            "CAUSE(LOW_OXYGEN, BREATHLESSNESS)",
            "CAUSE(PURPLISH_BLOOD, BLUE_SKIN)",
            "CAUSE(BETA_BLOCKERS, LESSEN_H)", 
            "REPLACE(VALVES, A)",  
            "REPLACE(DISEASED_HEART, DONOR_HEART)",
            "ENABLE(MECHANICAL_DEVICES, HEART_FUNCTIONING)",
            "ENABLE(PACEMAKER, STEADY_BEAT)"
        ],
        "propositions_low_knowledge": [
            "HARDWORKING(HEART, ORGAN)",
            "IN(BODY, HEART)",
            "RELY(WE, BLOOD_SUPPLY)",
            "REGULAR(BLOOD_SUPPLY)",
            "MOMENTARY(RELY(WE, BLOOD_SUPPLY))",
            "THREAT_TO_LIFE(DISORDER_STOP(BLOOD_SUPPLY))",
            "COMMON(HEART_DISEASE)",
            "KILL(HEART_DISEASE, PEOPLE)",
            "COMPARE(KILL(HEART_DISEASE, US), ALL_OTHER_DISEASES)",
            "IS(CONGENITAL_DISEASE, DISEASE_BORN_WITH)",
            "BORN_WITH(PERFECT_HEART, MOST_BABIES)",
            "PROBABILITY(SOMETHING_GOES_WRONG, 1_IN_200)",
            "DEVELOP_WRONG_SHAPE(VALVE)",
            "TOO_TIGHT(VALVE)",
            "FAIL_TO_CLOSE(VALVE)",
            "GAP(SEPTAL_WALL)",
            "BETWEEN(SEPTAL_WALL, TWO_SIDES(HEART))",
            "CALL(GAP, SEPTAL_DEFECT)",
            "BADLY_FORMED(BABY_HEART)",
            "INEFFICIENT(BADLY_FORMED(BABY_HEART))",
            "NOT_RECEIVE(BLOOD, ENOUGH_OXYGEN)",
            "BECOME(BABY, BREATHLESS)",
            "FAIL_REMOVE(BLOOD, CARBON_DIOXIDE)",
            "BECOME(BLOOD, PURPLISH)",
            "LOOK(BABY_SKIN, BLUE)",
            "POSSIBLE(SAVE(BLUE_BABIES))",
            "CAUSE(RHEUMATIC_FEVER, HEART_HARM)",
            "FOLLOW(RHEUMATIC_FEVER, SORE_THROAT)",
            "CAUSE(SORE_THROAT, STREPTOCOCCI)",
            "INFLAME(HEART_TISSUES)",
            "BADLY_AFFECTED(HEART)",
            "FAIL(HEART)",
            "USUALLY_RECOVER(HEART)",
            "DAMAGE_EFFECTS(APPEAR_YEARS_LATER)",
            "LEAVE_SCARS(VALVES)",
            "MALFUNCTION(VALVES)",
            "STRAIN_ON(HEART, SCARRED_VALVES)",
            "EVENTUALLY_FAIL(HEART)",
            "TAKE_YEARS(EFFECTS(RHEUMATIC_FEVER))",
            "CALLED(CORONARY_ARTERIES, HEART_BLOOD_VESSELS)",
            "SUPPLY(CORONARY_ARTERIES, HEART, BLOOD)",
            "IMPORTANT(CORONARY_ARTERIES)",
            "SUPPLY(CORONARY_ARTERIES, OXYGEN)",
            "NEED(HEART, OXYGEN)",
            "BLOCKED(CORONARY_ARTERIES)",
            "DIE(PARTS(HEART_MUSCLE))",
            "CAUSE(HEART_ATTACK, BLOCKED_CORONARY_ARTERIES)",
            "FATAL(HEART_ATTACK)",
            "CAUSE(BLOCKAGE, THROMBUS)",
            "CAUSE(THROMBUS, BLOOD_CLOT)",
            "FORM(CLOT, CORONARY_ARTERY)",
            "CALL(CORONARY_THROMBOSIS, HEART_ATTACK)",
            "NORMAL_ARTERIES(NO_CLOT)",
            "NARROW(VESSEL_WALLS_IN_CORONARY_DISEASE)",
            "ROUGH(VESSEL_WALLS_IN_CORONARY_DISEASE)",
            "ARRHYTHMIA(IS, INTERRUPTED_HEART_BEAT)",
            "ANGINA(IS, CHEST_PAIN)",
            "SIMILAR_TO(ANGINA, THROMBOSIS_PAIN)",
            "COMMON(HIGH_BLOOD_PRESSURE)",
            "UNTREATED(HIGH_BLOOD_PRESSURE, LEAD_TO([HEART_ATTACK, KIDNEY_FAILURE, OTHER_PROBLEMS]))",
            "MAY_HAVE_NO_SYMPTOMS(HIGH_BLOOD_PRESSURE)",
            "DETECT(HIGH_BLOOD_PRESSURE, MEASUREMENT)",
            "INCLUDE(NEW_DRUGS, BETA_BLOCKERS)",
            "FUNCTION(BETA_BLOCKERS, LESSEN(AFTER_EFFECTS(HEART_ATTACK)))",
            "PREVENT(BETA_BLOCKERS, SECOND_ATTACK)",
            "LOWER(BETA_BLOCKERS, BLOOD_PRESSURE)",
            "DISSOLVE(OTHER_DRUGS, LUMPS_FROM_ARTERIES)",
            "MORE_COMMON(HEART_TRANSPLANT, MECHANICAL_HEART)",
            "REPLACE(TRANSPLANT_SURGERY, DISEASED_HEART, DONOR_HEART)",
            "IMPLANT(MECHANICAL_DEVICES, BODIES)",
            "FUNCTION_SUPPORT(MECHANICAL_DEVICES, HEART)",
            "IS(PACEMAKER, COMMON_DEVICE)",
            "NOT_HEAL(PACEMAKER, HEART)",
            "RELIEVE(PACEMAKER, IRREGULAR_HEART_SYMPTOMS)",
            "MAINTAIN(PACEMAKER, STEADY_BEAT)",
            "REPLACE(VALVES, ARTIFICIAL_VALVES)",
            "MATERIALS(ARTIFICIAL_VALVES, [PLASTIC, METAL])",
            "REPAIR(BYPASS_SURGERY, BLOOD_VESSELS)",
            "USE(BYPASS_SURGERY, VEINS_FROM_LEG)",
            "REPLACE(BYPASS, DAMAGED_ARTERIES)",
            "CAUSE(CHOLESTEROL, FATTY_BUILDUP)",
            "LEAD_TO(FATTY_BUILDUP, HEART_DISEASE)",
            "RECOMMEND(DIET_LOW_IN_FATS)",
            "INCREASE(SALT, BLOOD_PRESSURE)",
            "RECOMMEND(DIET_LOW_IN_SALT)"   
        ],
        "recall_low_knowledge_propositions": "The heart is a hardworking organ in the body. It is located inside the body and is essential because we rely on a regular blood supply every moment. Any disorder that stops this blood supply is a threat to life. Heart disease is a common condition and kills many people. In the U.S., more people are killed by heart disease than by any other disease. A congenital disease is a type of disease that a person is born with. Most babies are born with perfect hearts, but in about one out of every 200 cases, something goes wrong. Sometimes a valve in the heart develops the wrong shape—it may be too tight or fail to close. Occasionally, a gap remains in the septal wall between the two sides of the heart. This is called a septal defect. If a baby's heart is badly formed, it cannot work efficiently. The blood does not receive enough oxygen, causing the baby to become breathless. The blood may also fail to remove carbon dioxide and turn purplish, making the baby's skin look blue. It is possible to save such \"blue babies.\" Rheumatic fever can cause harm to the heart. It often follows a sore throat caused by streptococci. This condition inflames the heart tissues, and the heart may be badly affected. Sometimes it fails, although it usually recovers. However, the effects of the damage can appear years later. The valves may be left with scars and not work properly, placing strain on the heart and possibly leading to eventual failure. These effects can take years to develop. The heart receives blood through the coronary arteries, which are its own blood vessels. These arteries are important because they supply the heart with oxygen, which it needs. If the coronary arteries are blocked, parts of the heart muscle may die. This can cause a heart attack, which is often fatal. One cause of blockage is a thrombus, a blood clot that forms in a coronary artery. This condition is also called coronary thrombosis. In a normal artery, no clot is present. In coronary disease, the vessel walls become narrow and rough. An arrhythmia is when the heartbeat is interrupted, while angina is chest pain that can feel similar to the pain from thrombosis. High blood pressure is also common. If untreated, it can lead to heart attacks, kidney failure, and other problems. It may show no symptoms but can be detected through measurement. New drugs have been developed to treat heart disease. Beta blockers can lessen the after-effects of a heart attack, prevent a second attack, and lower blood pressure. Other drugs can dissolve the lumps that break off from artery walls. Surgical methods also exist. A heart transplant is now more common than the use of a mechanical heart. In transplant surgery, a diseased heart is replaced with a donor heart. Mechanical devices can also be implanted into the body to help the heart function. The pacemaker is the most common of these devices. While it does not heal the heart, it helps relieve symptoms of irregular heartbeat and maintains a steady beat. In some cases, damaged valves are replaced with artificial valves made of plastic or metal. Bypass surgery repairs blood vessels using veins from the leg to replace damaged arteries. Cholesterol can cause fatty buildup in the arteries, which can lead to heart disease. To prevent this, a diet low in fats is recommended. Increased salt in the diet can raise blood pressure, so a diet low in salt is also advised.",
        "low_knowledge_recalled_propositions": [
            "IS(HEART, ORGAN)",
            "IN(HEART, BODY)",
            "RELY(WE, BLOOD_SUPPLY)",
            "IS(BLOOD_SUPPLY, REGULAR)",
            "EVERY_MOMENT(RELY(WE, BLOOD_SUPPLY))",
            "THREAT_TO_LIFE(STOP(BLOOD_SUPPLY))",
            "IS_COMMON(HEART_DISEASE)",
            "KILL(HEART_DISEASE, MANY_PEOPLE)",
            "COMPARE(KILL(HEART_DISEASE, US), ALL_OTHER_DISEASES)",
            "IS(CONGENITAL_DISEASE, BIRTH_DEFECT)",
            "BORN_WITH(MOST_BABIES, PERFECT_HEARTS)",
            "OCCUR(SOMETHING_WRONG, ONE_IN_200_BABIES)",
            "DEVELOP(VALVE, WRONG_SHAPE)",
            "TOO_TIGHT(VALVE)",
            "FAIL_TO_CLOSE(VALVE)",
            "REMAIN(GAP, SEPTAL_WALL)",
            "BETWEEN(SEPTAL_WALL, SIDES_OF_HEART)",
            "IS(GAP, SEPTAL_DEFECT)",
            "BADLY_FORMED(BABY_HEART)",
            "INEFFICIENT(BABY_HEART)",
            "NOT_RECEIVE(BLOOD, ENOUGH_OXYGEN)",
            "BECOME(BABY, BREATHLESS)",
            "FAIL_REMOVE(BLOOD, CARBON_DIOXIDE)",
            "BECOME(BLOOD, PURPLISH)",
            "LOOK(BABY_SKIN, BLUE)",
            "POSSIBLE(SAVE(BLUE_BABIES))",
            "CAUSE(RHEUMATIC_FEVER, HEART_HARM)",
            "FOLLOW(RHEUMATIC_FEVER, SORE_THROAT)",
            "CAUSE(SORE_THROAT, STREPTOCOCCI)",
            "INFLAME(HEART_TISSUES)",
            "AFFECT(HEART, BADLY)",
            "MAY_FAIL(HEART)",
            "USUALLY_RECOVER(HEART)",
            "APPEAR(DAMAGE_EFFECTS, YEARS_LATER)",
            "LEAVE_SCARS(VALVES)",
            "MALFUNCTION(VALVES)",
            "STRAIN(HEART, SCARRED_VALVES)",
            "EVENTUALLY_FAIL(HEART)",
            "SUPPLY(CORONARY_ARTERIES, HEART, BLOOD)",
            "SUPPLY(CORONARY_ARTERIES, OXYGEN)",
            "NEED(HEART, OXYGEN)",
            "BLOCKED(CORONARY_ARTERIES)",
            "DIE(HEART_MUSCLE_PARTS)",
            "CAUSE(BLOCKED_CORONARY_ARTERIES, HEART_ATTACK)",
            "IS_FATAL(HEART_ATTACK)",
            "CAUSE(BLOCKAGE, THROMBUS)",
            "IS(BLOOD_CLOT, THROMBUS)",
            "FORM(CLOT, CORONARY_ARTERY)",
            "IS(CORONARY_THROMBOSIS, HEART_ATTACK)",
            "NOT_PRESENT(CLOT, NORMAL_ARTERIES)",
            "NARROW(VESSEL_WALLS, CORONARY_DISEASE)",
            "ROUGH(VESSEL_WALLS, CORONARY_DISEASE)",
            "IS(ARRHYTHMIA, INTERRUPTED_HEARTBEAT)",
            "IS(ANGINA, CHEST_PAIN)",
            "SIMILAR(ANGINA, THROMBOSIS_PAIN)",
            "IS_COMMON(HIGH_BLOOD_PRESSURE)",
            "IF_UNTREATED(HIGH_BLOOD_PRESSURE, LEAD_TO([HEART_ATTACK, KIDNEY_FAILURE, OTHER_PROBLEMS]))",
            "MAY_HAVE_NO_SYMPTOMS(HIGH_BLOOD_PRESSURE)",
            "DETECT(HIGH_BLOOD_PRESSURE, MEASUREMENT)",
            "INCLUDE(NEW_DRUGS, BETA_BLOCKERS)",
            "LESSEN(BETA_BLOCKERS, AFTER_EFFECTS(HEART_ATTACK))",
            "PREVENT(BETA_BLOCKERS, SECOND_ATTACK)",
            "LOWER(BETA_BLOCKERS, BLOOD_PRESSURE)",
            "DISSOLVE(OTHER_DRUGS, ARTERY_LUMPS)",
            "MORE_COMMON(HEART_TRANSPLANT, MECHANICAL_HEART)",
            "REPLACE(TRANSPLANT_SURGERY, DISEASED_HEART, DONOR_HEART)",
            "IMPLANT(MECHANICAL_DEVICES, HUMAN_BODIES)",
            "SUPPORT_FUNCTION(MECHANICAL_DEVICES, HEART)",
            "IS(PACEMAKER, COMMON_DEVICE)",
            "NOT_HEAL(PACEMAKER, HEART)",
            "RELIEVE(PACEMAKER, IRREGULAR_HEART_SYMPTOMS)",
            "MAINTAIN(PACEMAKER, STEADY_HEARTBEAT)",
            "REPLACE(DAMAGED_VALVES, ARTIFICIAL_VALVES)",
            "MATERIALS(ARTIFICIAL_VALVES, [PLASTIC, METAL])",
            "REPAIR(BYPASS_SURGERY, BLOOD_VESSELS)",
            "USE(BYPASS_SURGERY, VEINS_FROM_LEG)",
            "REPLACE(DAMAGED_ARTERIES, BYPASS)",
            "CAUSE(CHOLESTEROL, FATTY_BUILDUP)",
            "LEAD_TO(FATTY_BUILDUP, HEART_DISEASE)",
            "RECOMMEND(DIET, LOW_FATS)",
            "INCREASE(SALT, BLOOD_PRESSURE)",
            "RECOMMEND(DIET, LOW_SALT)"
        ]
    }
]                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            