[
  {
    "stimulus_id": 0,
    "stimulus_source": "real stimuli",
    "text_content": "The city has announced an expansion of its public bicycle program to meet growing demand for eco-friendly transportation. Starting next month, 500 new bikes will be added to the fleet, and new docking stations will be installed across key areas. Launched three years ago, the program has seen significant growth, with daily ridership up by 20% in the past year. City officials believe the expansion will encourage more residents to bike rather than drive, especially for short trips. The new bikes have GPS tracking and improved safety features, including reflective strips and better lighting. Additionally, the city will launch a public awareness campaign to promote safe biking practices, including workshops and free helmets. The goal is to reduce traffic congestion and pollution while promoting a healthier lifestyle. With these initiatives, the city hopes to lead in sustainable urban transportation.",
    "num_sentences": 8,
    "sentence_appraisal_scores_distribution": [
      0.0,
      0.525,
      0.95,
      1.0,
      0.7,
      0.6,
      0.675,
      0.65,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1
    ],
    "sentence_lengths": [
      18,
      22,
      20,
      18,
      16,
      19,
      14,
      12
    ],
    "sentence_reading_times": [
      7.2,
      8.8,
      8.0,
      7.2,
      6.4,
      7.6000000000000005,
      5.6000000000000005,
      4.800000000000001
    ],
    "total_words": 139,
    "total_one_pass_reading_time": 55.60000000000001
  },
  {
    "stimulus_id": 1,
    "stimulus_source": "real stimuli",
    "text_content": "A local high school has launched a robotics program to inspire students to explore careers in science, technology, engineering, and mathematics (STEM). The program, which began this week, offers hands-on experience in designing and building robots, along with lessons in coding, electronics, and problem-solving. The school partnered with local tech companies to provide resources and mentorship. Students will also have the opportunity to compete in regional and national robotics competitions. The principal expressed enthusiasm, stating it provides a unique chance for students to engage with cutting-edge technology. Parents support the initiative, noting it prepares students for careers in a rapidly evolving job market. The program is expected to grow, with plans for advanced courses and summer camps. By investing in STEM education, the school aims to empower students to become innovators and leaders in technology.",
    "num_sentences": 8,
    "sentence_appraisal_scores_distribution": [
      0.351,
      1.0,
      0.595,
      0.703,
      0.27,
      0.081,
      0.0,
      0.108,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1
    ],
    "sentence_lengths": [
      22,
      22,
      12,
      14,
      17,
      16,
      14,
      18
    ],
    "sentence_reading_times": [
      8.8,
      8.8,
      4.800000000000001,
      5.6000000000000005,
      6.800000000000001,
      6.4,
      5.6000000000000005,
      7.2
    ],
    "total_words": 135,
    "total_one_pass_reading_time": 54.00000000000001
  },
  {
    "stimulus_id": 2,
    "stimulus_source": "real stimuli",
    "text_content": "The city’s community garden project is expanding and will soon reach more neighborhoods. This project, started five years ago, now has over 20 garden sites citywide. The expansion will add five more gardens across the city, especially in areas needing them most. These gardens give residents a chance to grow fruits and vegetables. Community gardens are important, providing fresh food and a place for neighbors to gather. The new gardens will feature raised beds, composting stations, and water-saving systems. Local volunteers will teach gardening classes to promote eco-friendly practices. City officials are excited about the gardens' environmental benefits of these gardens, reducing the city’s carbon footprint by encouraging local food production. They also add green spaces in crowded areas, improving neighborhood livability. The expansion has been funded by city grants and local business donations.",
    "num_sentences": 10,
    "sentence_appraisal_scores_distribution": [
      0.0,
      0.425,
      0.613,
      0.775,
      0.912,
      0.988,
      0.975,
      0.975,
      0.975,
      1.0,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1
    ],
    "sentence_lengths": [
      13,
      13,
      16,
      11,
      14,
      12,
      10,
      22,
      11,
      12
    ],
    "sentence_reading_times": [
      5.2,
      5.2,
      6.4,
      4.4,
      5.6000000000000005,
      4.800000000000001,
      4.0,
      8.8,
      4.4,
      4.800000000000001
    ],
    "total_words": 134,
    "total_one_pass_reading_time": 53.60000000000001
  },
  {
    "stimulus_id": 3,
    "stimulus_source": "real stimuli",
    "text_content": "Lately, I am making an effort to incorporate more sustainable practices into my routine. I first changed to reduce my reliance on single-use plastics. Switching to reusable bags, containers, and produce bags has significantly cut the waste I generate. I’ve also focused on minimizing food waste, which helps the environment and saves money. Meal planning has been a game-changer, as I only buy what I need, resulting in fewer leftovers. Additionally, I set up a small compost bin in my backyard. It’s gratifying to know my food scraps are repurposed into something beneficial for the garden instead of ending up in a landfill. I’m curious how others are working towards sustainability. What small changes you made that had a big impact? Let’s exchange ideas and support each other in making our community greener. Even small actions can lead to larger positive change to our daily lives!",
    "num_sentences": 11,
    "sentence_appraisal_scores_distribution": [
      0.85,
      0.25,
      0.2,
      0.0,
      0.3,
      0.55,
      0.85,
      0.95,
      0.95,
      1.0,
      0.95,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1
    ],
    "sentence_lengths": [
      14,
      10,
      15,
      14,
      17,
      11,
      22,
      8,
      10,
      12,
      13
    ],
    "sentence_reading_times": [
      5.6000000000000005,
      4.0,
      6.0,
      5.6000000000000005,
      6.800000000000001,
      4.4,
      8.8,
      3.2,
      4.0,
      4.800000000000001,
      5.2
    ],
    "total_words": 146,
    "total_one_pass_reading_time": 58.400000000000006
  },
  {
    "stimulus_id": 4,
    "stimulus_source": "real stimuli",
    "text_content": "Hello, fitness enthusiasts! I recently embarked on a new workout regimen and wanted to share a few insights that have helped me maintain consistency and stay motivated. Setting realistic, attainable goals has been essential. Instead of aiming for an intense workout daily, I’ve focused on incremental improvements, making progress more manageable and enjoyable. Another key factor has been having a workout partner, which has kept me accountable and added a social element, making exercise more fun. We check in regularly, keeping us on track. Finally, I’ve come to appreciate the importance of rest and recovery. Taking time to listen to my body and allow for proper rest days has actually enhanced my performance and overall well-being. If you’re starting a new routine, remember that consistency is key, but balance is equally important. Let’s keep pushing towards our fitness goals together!",
    "num_sentences": 10,
    "sentence_appraisal_scores_distribution": [
      0.0,
      0.965,
      0.849,
      0.733,
      0.756,
      0.756,
      0.884,
      0.942,
      1.0,
      0.977,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1
    ],
    "sentence_lengths": [
      3,
      24,
      7,
      19,
      23,
      8,
      11,
      21,
      16,
      8
    ],
    "sentence_reading_times": [
      1.2000000000000002,
      9.600000000000001,
      2.8000000000000003,
      7.6000000000000005,
      9.200000000000001,
      3.2,
      4.4,
      8.4,
      6.4,
      3.2
    ],
    "total_words": 140,
    "total_one_pass_reading_time": 56.00000000000001
  },
  {
    "stimulus_id": 5,
    "stimulus_source": "real stimuli",
    "text_content": "Hello fellow readers! I wanted to share my thoughts on a remarkable book I just finished, The Journey Within. This novel delves into themes of self-discovery and personal growth, exploring how the protagonist navigates complex emotional landscapes to understand themselves better. What struck me most was its ability to challenge my own perspectives. The author’s nuanced portrayal of the characters’ struggles felt incredibly authentic, prompting me to reflect on my own life decisions. It’s rare to find a book that entertains and prompts introspection. I’m eager to hear what everyone has been reading lately. Have you come across any books that left a lasting impression? Let’s discuss our favorite reads and share recommendations. There’s something special about connecting over a good book and exchanging ideas with fellow literature lovers. Looking forward to hearing your thoughts!",
    "num_sentences": 11,
    "sentence_appraisal_scores_distribution": [
      0.0,
      0.888,
      0.966,
      1.0,
      0.843,
      0.91,
      0.944,
      0.989,
      0.966,
      0.933,
      0.978,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1
    ],
    "sentence_lengths": [
      3,
      16,
      22,
      12,
      20,
      11,
      10,
      11,
      8,
      16,
      6
    ],
    "sentence_reading_times": [
      1.2000000000000002,
      6.4,
      8.8,
      4.800000000000001,
      8.0,
      4.4,
      4.0,
      4.4,
      3.2,
      6.4,
      2.4000000000000004
    ],
    "total_words": 135,
    "total_one_pass_reading_time": 54.0
  },
  {
    "stimulus_id": 6,
    "stimulus_source": "real stimuli",
    "text_content": "In today’s hyper-connected world, taking a step back from constant digital engagement can feel challenging but profoundly rewarding. A digital detox doesn’t necessarily mean abandoning technology altogether; rather, it’s about finding a healthy balance. I recently decided to implement a digital detox routine, where I set aside specific times during the day to disconnect from screens and reconnect with the physical world. One change was establishing tech-free zones in my home, like the bedroom and dining area, which has improved my sleep and presence during meals. I’ve also dedicated my mornings to analog activities like reading a book or taking a walk instead of reaching for my phone. The benefits have been noticeable—I feel more focused, less overwhelmed, and have more time for hobbies. If you’re considering a digital detox, start small by setting limits on social media or creating screen-free zones.",
    "num_sentences": 7,
    "sentence_appraisal_scores_distribution": [
      0.0,
      0.557,
      0.787,
      0.721,
      0.836,
      0.951,
      1.0,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1
    ],
    "sentence_lengths": [
      18,
      16,
      28,
      24,
      22,
      16,
      18
    ],
    "sentence_reading_times": [
      7.2,
      6.4,
      11.200000000000001,
      9.600000000000001,
      8.8,
      6.4,
      7.2
    ],
    "total_words": 142,
    "total_one_pass_reading_time": 56.800000000000004
  },
  {
    "stimulus_id": 7,
    "stimulus_source": "real stimuli",
    "text_content": "Cooking has always been something I needed to do every day, but recently, I’ve started seeing it as a way to relax and enjoy myself. Mindful cooking means paying full attention while making a meal, focusing on each step, and enjoying the process rather than rushing. I start by choosing fresh ingredients, noticing their colors, textures, and smells. As I cut, stir, and season, I pay attention to the sounds of vegetables cooking, the feel of the dough, and the aroma of spices. This way of cooking has changed how I feel about making food. Now, instead of thinking of it as just another chore, I see it as a creative activity and a way to take care of myself. It also makes the food taste better and more enjoyable, because each dish is made with care and attention.",
    "num_sentences": 7,
    "sentence_appraisal_scores_distribution": [
      0.171,
      0.0,
      0.114,
      0.457,
      0.543,
      0.886,
      1.0,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1
    ],
    "sentence_lengths": [
      25,
      21,
      12,
      25,
      12,
      25,
      19
    ],
    "sentence_reading_times": [
      10.0,
      8.4,
      4.800000000000001,
      10.0,
      4.800000000000001,
      10.0,
      7.6000000000000005
    ],
    "total_words": 139,
    "total_one_pass_reading_time": 55.6
  },
  {
    "stimulus_id": 8,
    "stimulus_source": "real stimuli",
    "text_content": "Traveling has always been one of my greatest passions, and over the years, I’ve learned that less truly is more when it comes to packing. Adopting a minimalist approach to travel has not only lightened my physical load but also enhanced my overall travel experience. The key is careful planning. Before each trip, I list essentials, focusing on versatile clothing and multipurpose items. This allows me to pack everything into a single carry-on, avoiding the hassle of checked luggage and making it easier to navigate airports and cities. Traveling light encourages a mindful experience. With fewer possessions to worry about, I can fully immerse myself in the destination, appreciating the culture and scenery without distractions. It has also taught me to value experiences over things, as the memories I create during my travels far outweigh any material items I might collect along the way.",
    "num_sentences": 8,
    "sentence_appraisal_scores_distribution": [
      0.071,
      1.0,
      0.786,
      0.0,
      0.643,
      0.286,
      0.714,
      0.714,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1,
      -1
    ],
    "sentence_lengths": [
      25,
      20,
      5,
      13,
      25,
      6,
      21,
      29
    ],
    "sentence_reading_times": [
      10.0,
      8.0,
      2.0,
      5.2,
      10.0,
      2.4000000000000004,
      8.4,
      11.600000000000001
    ],
    "total_words": 144,
    "total_one_pass_reading_time": 57.6
  }
]